sheulisback/ble-demo-wb05kn1-nucleo-u545/firmware/Middlewares/ST/STM32WB05N/includes/stm32wb05n_events.h
/**
 * @brief The LE Connection Complete event indicates to both of the Hosts
 *        forming the connection that a new connection has been created. Upon
 *        the creation of the connection a Connection_Handle shall be assigned
 *        by the Controller, and passed to the Host in this event. If the
 *        connection establishment fails this event shall be provided to the
 *        Host that had issued the LE_Create_Connection command. This event
 *        indicates to the Host which issued a LE_Create_Connection command and
 *        received a Command Status event if the connection establishment failed
 *        or was successful. The Central_Clock_Accuracy parameter is only valid
 *        for a peripheral. On a central, this parameter shall be set to 0x00.
 * @param Status For standard error codes see Bluetooth specification, Vol. 2,
 *        part D. For proprietary error code refer to Error codes section.
 * @param Connection_Handle Connection handle to be used to identify the
 *        connection with the peer device.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param Role Role of the local device in the connection.
 *        Values:
 *        - 0x00: Central
 *        - 0x01: Peripheral
 * @param Peer_Address_Type The address type of the peer device.
 *        Values:
 *        - 0x00: Public Device Address
 *        - 0x01: Random Device Address
 * @param Peer_Address Public Device Address or Random Device Address of the
 *        peer device
 * @param Connection_Interval Connection interval used on this connection. Time
 *        = N * 1.25 msec
 *        Values:
 *        - 0x0006 (7.50 ms)  ... 0x0C80 (4000.00 ms) 
 * @param Peripheral_Latency Maximum Peripheral latency for the connection in
 *        number of connection events.
 *        Values:
 *        - 0x0000 ... 0x01F3
 * @param Supervision_Timeout Supervision timeout for the LE Link. It shall be a
 *        multiple of 10 ms and larger than (1 + connPeripheralLatency) *
 *        connInterval * 2. Time = N * 10 msec.
 *        Values:
 *        - 0x000A (100 ms)  ... 0x0C80 (32000 ms) 
 * @param Central_Clock_Accuracy Central clock accuracy. Only valid for a
 *        Peripheral.
 *        Values:
 *        - 0x00: 500 ppm
 *        - 0x01: 250 ppm
 *        - 0x02: 150 ppm
 *        - 0x03: 100 ppm
 *        - 0x04: 75 ppm
 *        - 0x05: 50 ppm
 *        - 0x06: 30 ppm
 *        - 0x07: 20 ppm
 * @retval None
 */
void hci_le_connection_complete_event(uint8_t Status,
                                      uint16_t Connection_Handle,
                                      uint8_t Role,
                                      uint8_t Peer_Address_Type,
                                      uint8_t Peer_Address[6],
                                      uint16_t Connection_Interval,
                                      uint16_t Peripheral_Latency,
                                      uint16_t Supervision_Timeout,
                                      uint8_t Central_Clock_Accuracy);
/**
 * @brief The LE Advertising Report event indicates that a Bluetooth device or
 *        multiple Bluetooth devices have responded to an active scan or
 *        received some information during a passive scan. The Controller may
 *        queue these advertising reports and send information from multiple
 *        devices in one LE Advertising Report event.
 * @param Num_Reports Number of responses in this event.
 *        Values:
 *        - 0x01
 * @param Advertising_Report See @ref Advertising_Report_t
 * @retval None
 */
void hci_le_advertising_report_event(uint8_t Num_Reports,
                                     Advertising_Report_t Advertising_Report[]);
/**
 * @brief The LE Connection Update Complete event is used to indicate that the
 *        Controller process to update the connection has completed. On a
 *        peripheral, if no connection parameters are updated, then this event
 *        shall not be issued. On a central, this event shall be issued if the
 *        Connection_Update command was sent.
 * @param Status For standard error codes see Bluetooth specification, Vol. 2,
 *        part D. For proprietary error code refer to Error codes section.
 * @param Connection_Handle Connection handle to be used to identify the
 *        connection with the peer device.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param Connection_Interval Connection interval used on this connection. Time
 *        = N * 1.25 msec
 *        Values:
 *        - 0x0006 (7.50 ms)  ... 0x0C80 (4000.00 ms) 
 * @param Peripheral_Latency Maximum Peripheral latency for the connection in
 *        number of connection events.
 *        Values:
 *        - 0x0000 ... 0x01F3
 * @param Supervision_Timeout Supervision timeout for the LE Link. It shall be a
 *        multiple of 10 ms and larger than (1 + connPeripheralLatency) *
 *        connInterval * 2. Time = N * 10 msec.
 *        Values:
 *        - 0x000A (100 ms)  ... 0x0C80 (32000 ms) 
 * @retval None
 */
void hci_le_connection_update_complete_event(uint8_t Status,
                                             uint16_t Connection_Handle,
                                             uint16_t Connection_Interval,
                                             uint16_t Peripheral_Latency,
                                             uint16_t Supervision_Timeout);
/**
 * @brief The LE Read Remote Features Complete event is used to indicate the
 *        completion of the process of the Controller obtaining the used
 *        features of the remote Bluetooth device specified by the
 *        Connection_Handle event parameter.
 * @param Status For standard error codes see Bluetooth specification, Vol. 2,
 *        part D. For proprietary error code refer to Error codes section.
 * @param Connection_Handle Connection handle to be used to identify the
 *        connection with the peer device.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param LE_Features Bit Mask List of used LE features. For details see LE Link
 *        Layer specification.
 * @retval None
 */
void hci_le_read_remote_features_complete_event(uint8_t Status,
                                                uint16_t Connection_Handle,
                                                uint8_t LE_Features[8]);
/**
 * @brief The LE Long Term Key Request event indicates that the central device
 *        is attempting to encrypt or re-encrypt the link and is requesting the
 *        Long Term Key from the Host. (See [Vol 6] Part B, Section 5.1.3).
 * @param Connection_Handle Connection handle to be used to identify the
 *        connection with the peer device.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param Random_Number 64-bit random number
 * @param Encrypted_Diversifier 16-bit encrypted diversifier
 * @retval None
 */
void hci_le_long_term_key_request_event(uint16_t Connection_Handle,
                                        uint8_t Random_Number[8],
                                        uint16_t Encrypted_Diversifier);
/**
 * @brief The LE Data Length Change event notifies the Host of a change to
 *        either the maximum Payload length or the maximum transmission time of
 *        Data Channel PDUs in either direction. The values reported are the
 *        maximum that will actually be used on the connection following the
 *        change.
 * @param Connection_Handle Connection_Handle to be used to identify a
 *        connection.
 * @param MaxTxOctets The maximum number of payload octets in a Link Layer Data
 *        Channel PDU that the local Controller will send on this connection
 *        (connEffectiveMaxTxOctets defined in [Vol 6] Part B, Section 4.5.10).
 *        Range 0x001B-0x00FB (0x0000 - 0x001A and 0x00FC - 0xFFFF Reserved for
 *        future use)
 * @param MaxTxTime The maximum time that the local Controller will take to send
 *        a Link Layer Data Channel PDU on this connection (connEffectiveMaxTx-
 *        Time defined in [Vol 6] Part B, Section 4.5.10). Range 0x0148-0x0848
 *        (0x0000 - 0x0127 and 0x0849 - 0xFFFF Reserved for future use)
 * @param MaxRxOctets The maximum number of payload octets in a Link Layer Data
 *        Channel PDU that the local controller expects to receive on this
 *        connection (connEfectiveMaxRxOctets defined in [Vol 6] Part B, Section
 *        4.5.10). Range 0x001B-0x00FB (0x0000 - 0x001A and 0x00FC - 0xFFFF
 *        Reserved for future use)
 * @param MaxRxTime The maximum time that the local Controller expects to take
 *        to receive a Link Layer Data Channel PDU on this connection
 *        (connEffectiveMax-RxTime defined in [Vol 6] Part B, Section 4.5.10).
 *        Range 0x0148-0x0848 (0x0000 - 0x0127 and 0x0849 - 0xFFFF Reserved for
 *        future use)
 * @retval None
 */
void hci_le_data_length_change_event(uint16_t Connection_Handle,
                                     uint16_t MaxTxOctets,
                                     uint16_t MaxTxTime,
                                     uint16_t MaxRxOctets,
                                     uint16_t MaxRxTime);
/**
 * @brief This event is generated when local P-256 key generation is complete.
 * @param Status For standard error codes see Bluetooth specification, Vol. 2,
 *        part D. For proprietary error code refer to Error codes section.
 * @param Local_P256_Public_Key Local P-256 public key.
 * @retval None
 */
void hci_le_read_local_p256_public_key_complete_event(uint8_t Status,
                                                      uint8_t Local_P256_Public_Key[64]);
/**
 * @brief This event indicates that LE Diffie Hellman key generation has been
 *        completed by the Controller.
 * @param Status For standard error codes see Bluetooth specification, Vol. 2,
 *        part D. For proprietary error code refer to Error codes section.
 * @param DHKey Diffie Hellman Key
 * @retval None
 */
void hci_le_generate_dhkey_complete_event(uint8_t Status,
                                          uint8_t DHKey[32]);
/**
 * @brief The LE Enhanced Connection Complete event indicates to both of the
 *        Hosts forming the connection that a new connection has been created.
 *        Upon the creation of the connection a Connection_Handle shall be
 *        assigned by the Controller, and passed to the Host in this event. If
 *        the connection establishment fails, this event shall be provided to
 *        the Host that had issued the LE_Create_Connection command. If this
 *        event is unmasked and LE Connection Complete event is unmasked, only
 *        the LE Enhanced Connection Complete event is sent when a new
 *        connection has been completed. This event indicates to the Host that
 *        issued a LE_Create_Connection command and received a Command Status
 *        event if the connection establishment failed or was successful. The
 *        Central_Clock_Accuracy parameter is only valid for a peripheral. On a
 *        central, this parameter shall be set to 0x00.
 * @param Status For standard error codes see Bluetooth specification, Vol. 2,
 *        part D. For proprietary error code refer to Error codes section.
 * @param Connection_Handle Connection handle to be used to identify the
 *        connection with the peer device.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param Role Role of the local device in the connection.
 *        Values:
 *        - 0x00: Central
 *        - 0x01: Peripheral
 * @param Peer_Address_Type 0x00 Public Device Address 0x01 Random Device
 *        Address 0x02 Public Identity Address (Corresponds to Resolved Private
 *        Address) 0x03 Random (Static) Identity Address (Corresponds to
 *        Resolved Private Address)
 *        Values:
 *        - 0x00: Public Device Address
 *        - 0x01: Random Device Address
 *        - 0x02: Public Identity Address
 *        - 0x03: Random (Static) Identity Address
 * @param Peer_Address Public Device Address, Random Device Address, Public
 *        Identity Address or Random (static) Identity Address of the device to
 *        be connected.
 * @param Local_Resolvable_Private_Address Resolvable Private Address being used
 *        by the local device for this connection. This is only valid when the
 *        Own_Address_Type is set to 0x02 or 0x03. For other Own_Address_Type
 *        values, the Controller shall return all zeros.
 * @param Peer_Resolvable_Private_Address Resolvable Private Address being used
 *        by the peer device for this connection. This is only valid for
 *        Peer_Address_Type 0x02 and 0x03. For other Peer_Address_Type values,
 *        the Controller shall return all zeros.
 * @param Connection_Interval Connection interval used on this connection. Time
 *        = N * 1.25 msec
 *        Values:
 *        - 0x0006 (7.50 ms)  ... 0x0C80 (4000.00 ms) 
 * @param Peripheral_Latency Maximum Peripheral latency for the connection in
 *        number of connection events.
 *        Values:
 *        - 0x0000 ... 0x01F3
 * @param Supervision_Timeout Supervision timeout for the LE Link. It shall be a
 *        multiple of 10 ms and larger than (1 + connPeripheralLatency) *
 *        connInterval * 2. Time = N * 10 msec.
 *        Values:
 *        - 0x000A (100 ms)  ... 0x0C80 (32000 ms) 
 * @param Central_Clock_Accuracy Central clock accuracy. Only valid for a
 *        Peripheral.
 *        Values:
 *        - 0x00: 500 ppm
 *        - 0x01: 250 ppm
 *        - 0x02: 150 ppm
 *        - 0x03: 100 ppm
 *        - 0x04: 75 ppm
 *        - 0x05: 50 ppm
 *        - 0x06: 30 ppm
 *        - 0x07: 20 ppm
 * @retval None
 */
void hci_le_enhanced_connection_complete_event(uint8_t Status,
                                               uint16_t Connection_Handle,
                                               uint8_t Role,
                                               uint8_t Peer_Address_Type,
                                               uint8_t Peer_Address[6],
                                               uint8_t Local_Resolvable_Private_Address[6],
                                               uint8_t Peer_Resolvable_Private_Address[6],
                                               uint16_t Connection_Interval,
                                               uint16_t Peripheral_Latency,
                                               uint16_t Supervision_Timeout,
                                               uint8_t Central_Clock_Accuracy);
/**
 * @brief The HCI_LE_Directed_Advertising_Report event indicates that directed
 *        advertisements have been received where the advertiser is using a
 *        resolvable private address for the TargetA field of the advertising
 *        PDU which the Controller is unable to resolve and the
 *        Scanning_Filter_Policy is equal to 0x02 or 0x03. Direct_Address_Type
 *        and Direct_Address specify the address the directed advertisements are
 *        being directed to. Address_Type and Address specify the address of the
 *        advertiser sending the directed advertisements. The Controller may
 *        queue these advertising reports and send information from multiple
 *        advertisers in one HCI_LE_Directed_Advertising_Report event. This
 *        event shall only be generated if scanning was enabled using the
 *        HCI_LE_Set_Scan_Enable command. It only reports advertising events
 *        that used legacy advertising PDUs.
 * @param Num_Reports Number of responses in this event.
 *        Values:
 *        - 0x01
 * @param Direct_Advertising_Report See @ref Direct_Advertising_Report_t
 * @retval None
 */
void hci_le_directed_advertising_report_event(uint8_t Num_Reports,
                                              Direct_Advertising_Report_t Direct_Advertising_Report[]);
/**
 * @brief The LE PHY Update Complete Event is used to indicate that the
 *        Controller has changed the transmitter PHY or receiver PHY in use. If
 *        the Controller changes the transmitter PHY, the receiver PHY, or both
 *        PHYs, this event shall be issued. If an LE_Set_PHY command was sent
 *        and the Controller determines that neither PHY will change as a
 *        result, it issues this event immediately.
 * @param Status For standard error codes see Bluetooth specification, Vol. 2,
 *        part D. For proprietary error code refer to Error codes section.
 * @param Connection_Handle Connection_Handle to be used to identify a
 *        connection.
 * @param TX_PHY The transmitter PHY for the connection
 *        Values:
 *        - 0x01: The transmitter PHY for the connection is LE 1M
 *        - 0x02: The transmitter PHY for the connection is LE 2M
 *        - 0x03: The transmitter PHY for the connection is LE Coded
 * @param RX_PHY The receiver PHY for the connection
 *        Values:
 *        - 0x01: The receiver PHY for the connection is LE 1M
 *        - 0x02: The receiver PHY for the connection is LE 2M
 *        - 0x03: The receiver PHY for the connection is LE Coded
 * @retval None
 */
void hci_le_phy_update_complete_event(uint8_t Status,
                                      uint16_t Connection_Handle,
                                      uint8_t TX_PHY,
                                      uint8_t RX_PHY);
/**
 * @brief The LE Extended Advertising Report event indicates that one or more
 *        Bluetooth devices have responded to an active scan or have broadcast
 *        advertisements that were received during a passive scan. The
 *        Controller may coalesce multiple advertising reports from the same or
 *        different advertisers into a single LE Extended Advertising Report
 *        event, provided all the parameters from all the advertising reports
 *        fit in a single HCI event. This event shall only be generated if
 *        scanning was enabled using the LE Set Extended Scan Enable command. It
 *        reports advertising events using either legacy or extended advertising
 *        PDUs. The Controller may split the data from a single advertisement
 *        (whether one PDU or several) into several reports. If so, each report
 *        except the last shall have an Event_Type with a data status field of
 *        "incomplete, more data to come", while the last shall have the value
 *        "complete"; the Address_Type, Address, Advertising_SID, Primary_PHY,
 *        and Secondary_PHY fields shall be the same in all the reports. When a
 *        scan response is received, bits 0-2 and 4 of the event type shall
 *        indicate the properties of the original advertising event. An
 *        Event_Type with a data status field of "incomplete, data truncated"
 *        indicates that the Controller attempted to receive an AUX_CHAIN_IND
 *        PDU but was not successful.
 * @param Num_Reports Number of separate reports in the event
 *        Values:
 *        - 0x01 ... 0x0A
 * @param Extended_Advertising_Report See @ref Extended_Advertising_Report_t
 * @retval None
 */
void hci_le_extended_advertising_report_event(uint8_t Num_Reports,
                                              Extended_Advertising_Report_t Extended_Advertising_Report[]);
/**
 * @brief The LE Periodic Advertising Report event indicates that the Controller
 *        has received a Periodic Advertising packet. The Sync_Handle parameter
 *        indicates the identifier for the periodic advertisements specified by
 *        the Advertising SID subfield of the ADI field in the ADV_EXT_IND PDU.
 *        The Controller may split the data from a single periodic advertisement
 *        (whether one PDU or several) into several reports. If so, each report
 *        except the last shall have a Data_Status of "incomplete, more data to
 *        come", while the last shall have the value "complete". A Data_Status
 *        of "incomplete, data truncated" indicates that the Controller
 *        attempted to receive an AUX_CHAIN_IND PDU but was not successful. The
 *        Unused parameter shall be set to 0xFF by the Controller and ignored by
 *        the Host.
 * @param Status For standard error codes see Bluetooth specification, Vol. 2,
 *        part D. For proprietary error code refer to Error codes section.
 * @param Sync_Handle Sync handle that identifies the synchronization
 *        information about the periodic advertising train.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param Advertising_SID Advertising SID subfield in the ADI field of the PDU
 *        Values:
 *        - 0x00 ... 0x0F: Value of the Advertising SID subfield in the ADI field of the PDU
 *        - 0x10 ... 0xFF: Reserved for future use
 * @param Advertiser_Address_Type Advertising Adress Type
 *        Values:
 *        - 0x00: Public Device Address
 *        - 0x01: Random Device Address
 *        - 0x02: Public Identity Address (corresponds to Resolved Private Address)
 *        - 0x03: Random (static) Identity Address (corresponds to Resolved PrivateAddress)
 * @param Advertiser_Address Public Device Address, Random Device Address,
 *        Public Identity Address, or Random (static) Identity Address of the
 *        advertiser
 * @param Advertiser_PHY Advertiser PHY
 *        Values:
 *        - 0x01: Advertiser PHY is LE 1M
 *        - 0x02: Advertiser PHY is LE 2M
 *        - 0x03: Advertiser PHY is LE Coded
 *        - 0x04 ... 0xFF: Reserved for future use
 * @param Periodic_Advertising_Interval Periodic Advertising Interval Time = N *
 *        1.25 ms Time Range: 7.5 ms to 81.91875 s
 *        Values:
 *        - 0x0006 (7.50 ms)  ... 0xFFFF (NaN) 
 * @param Advertiser_Clock_Accuracy Advertiser Clock Accuracy
 *        Values:
 *        - 0x00: 500 ppm
 *        - 0x01: 250 ppm
 *        - 0x02: 150 ppm
 *        - 0x03: 100 ppm
 *        - 0x04: 75 ppm
 *        - 0x05: 50 ppm
 *        - 0x06: 30 ppm
 *        - 0x07: 20 ppm
 *        - 0x08 ... 0xFF: Reserved for future use
 * @retval None
 */
void hci_le_periodic_advertising_sync_established_event(uint8_t Status,
                                                        uint16_t Sync_Handle,
                                                        uint8_t Advertising_SID,
                                                        uint8_t Advertiser_Address_Type,
                                                        uint8_t Advertiser_Address[6],
                                                        uint8_t Advertiser_PHY,
                                                        uint16_t Periodic_Advertising_Interval,
                                                        uint8_t Advertiser_Clock_Accuracy);
/**
 * @brief The LE Periodic Advertising Report event indicates that the Controller
 *        has received a Periodic Advertising packet. The Sync_Handle parameter
 *        indicates the identifier for the periodic advertisements specified by
 *        the Advertising SID subfield of the ADI field in the ADV_EXT_IND PDU.
 *        The Controller may split the data from a single periodic advertisement
 *        (whether one PDU or several) into several reports. If so, each report
 *        except the last shall have a Data_Status of "incomplete, more data to
 *        come", while the last shall have the value "complete". A Data_Status
 *        of "incomplete, data truncated" indicates that the Controller
 *        attempted to receive an AUX_CHAIN_IND PDU but was not successful. The
 *        Unused parameter shall be set to 0xFF by the Controller and ignored by
 *        the Host.
 * @param Sync_Handle Sync handle that identifies the synchronization
 *        information about the periodic advertising train.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param TX_Power TX Power. Units: dBm
 *        Values:
 *        - -127 ... 126
 *        - 127: NA
 * @param RSSI RSSI value Units: dBm
 *        Values:
 *        - -127 ... 20: RSSI value
 *        - 127: RSSI is not available
 * @param CTE_Type
 *        Values:
