sheulisback/ble-demo-wb05kn1-nucleo-u545/firmware/Middlewares/ST/STM32WB05N/includes/stm32wb05n_events.h
 *        - 0x00: AoA Constant Tone Extension
 *        - 0x01: AoD Constant Tone Extension with 1 microsecond slots
 *        - 0x02: AoD Constant Tone Extension with 2 microseconds slots
 *        - 0xFF: No Constant Tone Extension
 * @param Data_Status Data Status
 *        Values:
 *        - 0x00: Data complete
 *        - 0x01: Data incomplete, more data to come
 *        - 0x02: Data incomplete, data truncated, no more to come
 *        - 0x03 ... 0xFF: Reserved for future use
 * @param Data_Length Length of the Data field
 *        Values:
 *        - 0 ... 247: Length of the Data field
 *        - 248 ... 255: Reserved for future use
 * @param Data Data received from a Periodic Advertising packet
 * @retval None
 */
void hci_le_periodic_advertising_report_event(uint16_t Sync_Handle,
                                              int8_t TX_Power,
                                              int8_t RSSI,
                                              uint8_t CTE_Type,
                                              uint8_t Data_Status,
                                              uint8_t Data_Length,
                                              uint8_t Data[]);
/**
 * @brief The LE Periodic Advertising Sync Lost event indicates that the
 *        Controller has not received a Periodic Advertising packet identified
 *        by Sync_Handle within the timeout period.
 * @param Sync_Handle Sync handle that identifies the synchronization
 *        information about the periodic advertising train.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @retval None
 */
void hci_le_periodic_advertising_sync_lost_event(uint16_t Sync_Handle);
/**
 * @brief The LE Scan Timeout event indicates that scanning has ended because
 *        the duration has expired. This event shall only be generated if
 *        scanning was enabled using the LE Set Extended Scan Enable command.
 * @retval None
 */
void hci_le_scan_timeout_event(void);
/**
 * @brief The LE Advertising Set Terminated event indicates that the Controller
 *        has terminated advertising in the advertising sets specified by the
 *        Advertising_Handle parameter. This event shall be generated every time
 *        connectable advertising in an advertising set results in a connection
 *        being created. This event shall only be generated if advertising was
 *        enabled using the LE Set Extended Advertising Enable command. The
 *        Connection_Handle parameter is only valid when advertising ends
 *        because a connection was created. If the
 *        Max_Extended_Advertising_Events parameter in the
 *        LE_Set_Extended_Advertising_Enable command was non-zero, the
 *        Num_Completed_Extended_Advertising_Events parameter shall be set to
 *        the number of completed extended advertising events the Controller had
 *        transmitted when either the duration elapsed or the maximum number of
 *        extended advertising events was reached; otherwise it shall be set to
 *        zero. If advertising has terminated as a result of the advertising
 *        duration elapsing, the Status parameter shall be set to the error code
 *        Advertising Timeout (0x3C). If advertising has terminated because the
 *        Max_Extended_Advertising_Events was reached, the Status parameter
 *        shall be set to the error code Limit Reached (0x43).
 * @param Status For standard error codes see Bluetooth specification, Vol. 2,
 *        part D. For proprietary error code refer to Error codes section.
 * @param Advertising_Handle Advertising handle in which advertising has ended
 *        Values:
 *        - 0x00 ... 0xEF: Advertising_Handle in which advertising has ended
 *        - 0xF0 ... 0xFF: Reserved for future use
 * @param Connection_Handle Connection_Handle to be used to identify a
 *        connection.
 * @param Num_Completed_Extended_Advertising_Events Number of completed extended
 *        advertising events transmitted by the Controller
 * @retval None
 */
void hci_le_advertising_set_terminated_event(uint8_t Status,
                                             uint8_t Advertising_Handle,
                                             uint16_t Connection_Handle,
                                             uint8_t Num_Completed_Extended_Advertising_Events);
/**
 * @brief The LE Scan Request Received event indicates that a SCAN_REQ PDU or an
 *        AUX_SCAN_REQ PDU has been received by the advertiser. The request
 *        contains a device address from a scanner that is allowed by the
 *        advertising filter policy. The advertising set is identified by
 *        Advertising_Handle. This event shall only be generated if advertising
 *        was enabled using the LE Set Extended Advertising Enable command. The
 *        Scanner_Address_Type and Scanner_Address indicates the type of the
 *        address and the address of the scanner device.
 * @param Advertising_Handle It is used to identify an advertising set
 *        Values:
 *        - 0x00 ... 0xEF: Used to identify an advertising set
 *        - 0xF0 ... 0xFF: Reserved for future use
 * @param Scanner_Address_Type Scanner address  type
 *        Values:
 *        - 0x00: Public Device Address
 *        - 0x01: Random Device Address
 *        - 0x02: Public Identity Address (corresponds to Resolved Private Address)
 *        - 0x03: Random (static) Identity Address (corresponds to Resolved Private
Address)
 *        - 0x04 ... 0xFF: Reserved for future use
 * @param Scanner_Address Public Device Address, Random Device Address, Public
 *        Identity Address or Random (static) Identity Address of the
 *        advertising device
 * @retval None
 */
void hci_le_scan_request_received_event(uint8_t Advertising_Handle,
                                        uint8_t Scanner_Address_Type,
                                        uint8_t Scanner_Address[6]);
/**
 * @brief The LE Channel Selection Algorithm Event indicates which channel
 *        selection algorithm is used on a data channel connection (see [Vol 6]
 *        Part B, Section 4.5.8).
 * @param Connection_Handle Connection_Handle to be used to identify a
 *        connection.
 * @param Channel_Selection_Algorithm Channel selection algorithm to be  used on
 *        a data channel connection
 *        Values:
 *        - 0x00: LE Channel Selection Algorithm #1 is used
 *        - 0x01: LE Channel Selection Algorithm #2 is used
 *        - 0x02 ... 0xFF: Reserved for future use
 * @retval None
 */
void hci_le_channel_selection_algorithm_event(uint16_t Connection_Handle,
                                              uint8_t Channel_Selection_Algorithm);
/**
 * @brief The HCI_LE_Connectionless_IQ_Report event is used by the Controller to
 *        report IQ information from the Constant Tone Extension of a received
 *        advertising packet forming part of the periodic advertising train
 *        identified by Sync_Handle and to report IQ information from the
 *        Constant Tone Extension of a received Test Mode packet (see Section
 *        7.8.28). The index of the channel on which the packet was received,
 *        the RSSI of the packet (excluding the Constant Tone Extension), the ID
 *        of the antenna on which this was measured, the type of Constant Tone
 *        Extension, the value of paEventCounter, and the IQ samples of the
 *        Constant Tone Extension of the advertisement are reported in the
 *        corresponding parameters. For any given sample, either both or neither
 *        of I_Sample[i] and Q_Sample[i] shall equal 0x80. The Slot_Durations
 *        parameter specifies the sampling rate used by the Controller. The
 *        Packet_Status parameter indicates whether the received packet had a
 *        valid CRC and, if not, whether the Controller has determined the
 *        position and size of the Constant Tone Extension using the Length and
 *        CTETime fields. Note: A Controller is not required to generate this
 *        event for packets that have a bad CRC. The Constant Tone Extension
 *        format is defined in [Vol 6] Part B, Section 2.5.1. If the PDU
 *        contains AdvData, then the HCI_LE_Periodic_Advertising_Report event
 *        shall be generated before this event. The Controller is not required
 *        to generate this event for a Constant Tone Extension with a type that
 *        it does not support. This event is also used by the Controller to
 *        report that it has insufficient resources to report IQ samples for all
 *        received Constant Tone Extensions and has failed to sample at least
 *        once. In this case Packet_Status shall be set to 0xFF and Sample_Count
 *        to 0x00.
 * @param Sync_Handle Sync_Handle identifying the periodic advertising train.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 *        - 0x0FFF: TEST_SYNC_HANDLE
 * @param Channel_Index 0x25-0x27 can be used only for packets generated during
 *        test modes.
 *        Values:
 *        - 0x00 ... 0x27: The index of the channel on which the packet was received.
 * @param RSSI RSSI of the packet. Units: 0.1 dBm.
 *        Values:
 *        - -1270 ... 200
 * @param RSSI_Antenna_ID Antenna ID
 * @param CTE_Type Type of Constant Tone Extension.
 *        Values:
 *        - 0x00: AoA_CTE
 *        - 0x01: AoD_CTE_1us
 *        - 0x02: AoD_CTE_2us
 * @param Slot_Durations Sampling rate used by the Controller.
 *        Values:
 *        - 0x01: CTE_SLOT_1us
 *        - 0x02: CTE_SLOT_2us
 * @param Packet_Status It indicates whether the received packet had a valid CRC
 *        and, if not, whether the Controller has determined the position and
 *        size of the Constant Tone Extension using the Length and CTETime
 *        fields. 0x00 - CRC was correct;  0x01 - CRC was incorrect and the
 *        Length and CTETime fields of the packet were used to determine
 *        sampling points;  0x02 - CRC was incorrect but the Controller has
 *        determined the position and length of the Constant Tone Extension in
 *        some other way;  0xFF - Insufficient resources to sample
 *        (Channel_Index, CTE_Type, and Slot_Durations invalid).
 *        Values:
 *        - 0x00: CRC_OK
 *        - 0x01: CRC_ERROR_1
 *        - 0x02: CRC_ERROR_2
 *        - 0xFF: NO_SAMPLES
 * @param Periodic_Event_Counter The value of paEventCounter (see [Vol 6] Part
 *        B, Section 4.4.2.1) for the reported AUX_SYNC_IND PDU
 * @param Sample_Count Total number of sample pairs (there shall be the same
 *        number of I samples and Q samples). Note: This number is dependent on
 *        the switch and sample slot durations used.
 *        Values:
 *        - 0x00
 *        - 0x09 ... 0x52
 * @param Samples See @ref Samples_t
 * @retval None
 */
void hci_le_connectionless_iq_report_event(uint16_t Sync_Handle,
                                           uint8_t Channel_Index,
                                           int16_t RSSI,
                                           uint8_t RSSI_Antenna_ID,
                                           uint8_t CTE_Type,
                                           uint8_t Slot_Durations,
                                           uint8_t Packet_Status,
                                           uint16_t Periodic_Event_Counter,
                                           uint8_t Sample_Count,
                                           Samples_t Samples[]);
/**
 * @brief The HCI_LE_Connection_IQ_Report event is used by the Controller to
 *        report the IQ samples from the Constant Tone Extension of a received
 *        packet (see [Vol 6] Part B, Section 2.4.2.26). The Connection_Handle
 *        parameter identifies the connection that corresponds to the reported
 *        information. The receiver PHY, the index of the data channel, the RSSI
 *        value of the packet (excluding the Constant Tone Extension), the ID of
 *        the antenna on which this was measured, the type of Constant Tone
 *        Extension, the value of connEventCounter, and the IQ samples of the
 *        Constant Tone Extension of the received packet are reported in the
 *        corresponding parameters. For any given sample, either both or neither
 *        of I_Sample[i] and Q_Sample[i] shall equal 0x80. The Slot_Durations
 *        parameter specifies the sampling rate used by the Controller. The
 *        Packet_Status parameter indicates whether the received packet had a
 *        valid CRC and, if not, whether the Controller has determined the
 *        position and size of the Constant Tone Extension using the Length and
 *        CTETime fields. Note: A Controller is not required to generate this
 *        event for packets that have a bad CRC. This event is also used by the
 *        Controller to report that it has insufficient resources to report IQ
 *        samples for all received Constant Tone Extensions and has failed to
 *        sample at least once. In this case Packet_Status shall be set to 0xFF
 *        and Sample_Count to 0x00. The Constant Tone Extension format is
 *        defined in [Vol 6] Part B, Section 2.1.5.
 * @param Connection_Handle Connection handle that identifies the connection.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param RX_PHY
 *        Values:
 *        - 0x01: The receiver PHY for the connection is LE 1M
 *        - 0x02: The receiver PHY for the connection is LE 2M
 * @param Data_Channel_Index
 *        Values:
 *        - 0x00 ... 0x24: The index of the data channel on which the Data Physical Channel PDU was received.
 * @param RSSI RSSI of the packet. Units: 0.1 dBm.
 *        Values:
 *        - -1270 ... 200
 * @param RSSI_Antenna_ID ID of the antenna on which the RSSI is measured
 * @param CTE_Type
 *        Values:
 *        - 0x00: AoA Constant Tone Extension
 *        - 0x01: AoD Constant Tone Extension with 1 microsecond slots
 *        - 0x02: AoD Constant Tone Extension with 2 microseconds slots
 * @param Slot_Durations Sampling rate used by the Controller.
 *        Values:
 *        - 0x01: CTE_SLOT_1us
 *        - 0x02: CTE_SLOT_2us
 * @param Packet_Status
 *        Values:
 *        - 0x00: CRC was correct
 *        - 0x01: CRC was incorrect and the Length and CTETime fields of the packet were used to determine sampling points
 *        - 0x02: CRC was incorrect but the Controller has determined the position and length of the Constant Tone Extension in some other way
 *        - 0xFF: Insufficient resources to sample (Channel_Index, CTE_Type, and Slot_Durations invalid).
 * @param Connection_Event_Counter The value of connEventCounter (see [Vol 6]
 *        Part B, Section 4.5.1) for the reported PDU
 * @param Sample_Count Total number of sample pairs.
 *        Values:
 *        - 0x00
 *        - 0x09 ... 0x52
 * @param Samples See @ref Samples_t
 * @retval None
 */
void hci_le_connection_iq_report_event(uint16_t Connection_Handle,
                                       uint8_t RX_PHY,
                                       uint8_t Data_Channel_Index,
                                       int16_t RSSI,
                                       uint8_t RSSI_Antenna_ID,
                                       uint8_t CTE_Type,
                                       uint8_t Slot_Durations,
                                       uint8_t Packet_Status,
                                       uint16_t Connection_Event_Counter,
                                       uint8_t Sample_Count,
                                       Samples_t Samples[]);
/**
 * @brief This event is used by the Controller to report an issue following a
 *        request to a peer device to reply with a packet containing an
 *        LL_CTE_RSP PDU and a Constant Tone Extension. It shall be generated if
 *        the packet containing the LL_CTE_RSP PDU sent in response did not
 *        contain a Constant Tone Extension or if the peer rejected the request.
 *        It shall not be generated if the packet containing the LL_CTE_RSP PDU
 *        had a CRC error or if the procedure response timeout timer (see [Vol
 *        6] Part B, Section 5.2) expired.
 * @param Status For standard error codes see Bluetooth specification, Vol. 2,
 *        part D. For proprietary error code refer to Error codes section.
 * @param Connection_Handle Connection handle that identifies the connection.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @retval None
 */
void hci_le_cte_request_failed_event(uint8_t Status,
                                     uint16_t Connection_Handle);
/**
 * @brief The HCI_LE_Periodic_Advertising_Sync_Transfer_Received event is used
 *        by the Controller to report that it has received periodic advertising
 *        synchronization information from the device referred to by the
 *        Connection_Handle parameter and either successfully synchronized to
 *        the periodic advertising train or timed out while attempting to
 *        synchronize. The Status will be zero if it successfully synchronized
 *        and non-zero otherwise. The Service_Data value is provided by the Host
 *        of the device sending the information. The Sync_Handle identifies the
 *        periodic advertising in subsequent commands and events and shall be
 *        assigned by the Controller. The remaining parameters provide
 *        information about the periodic advertising (see Section 7.7.65.14). If
 *        Status is non-zero, all parameter values are valid except Sync_Handle,
 *        which the Host shall ignore. Note: If the Controller is already
 *        synchronized to the periodic advertising train described in the
 *        received information, no event will be generated.
 * @param Status For standard error codes see Bluetooth specification, Vol. 2,
 *        part D. For proprietary error code refer to Error codes section.
 * @param Connection_Handle Connection handle that identifies the connection.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param Service_data A value provided by the peer device
 * @param Sync_Handle Sync handle that identifies the synchronization
 *        information about the periodic advertising train.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param Advertising_SID
 *        Values:
 *        - 0x00 ... 0x0F: Value of the Advertising SID used to advertise the periodic advertising
 * @param Advertiser_Address_Type
 *        Values:
 *        - 0x00: Public Device Address
 *        - 0x01: Random Device Address
 *        - 0x02: Public Identity Address (corresponds to Resolved Private Address)
 *        - 0x03: Random (static) Identity Address (corresponds to Resolved Private Address)
 * @param Advertiser_Address Public Device Address, Random Device Address,
 *        Public Identity Address, or Random (static) Identity Address of the
 *        advertiser
 * @param Advertiser_PHY
 *        Values:
 *        - 0x01: Advertiser PHY is LE 1M
 *        - 0x02: Advertiser PHY is LE 2M
 *        - 0x03: Advertiser PHY is LE Coded
 * @param Periodic_Advertising_Interval Periodic advertising interval. Time = N
 *        * 1.25 ms; Time Range: 7.5ms to 81.91875 s.
 *        Values:
 *        - 0x0006 (7.50 ms)  ... 0xFFFF (NaN) 
 * @param Advertiser_Clock_Accuracy Advertiser Clock Accuracy
 *        Values:
 *        - 0x00: 500 ppm
 *        - 0x01: 250 ppm
 *        - 0x02: 150 ppm
 *        - 0x03: 100 ppm
 *        - 0x04: 75 ppm
 *        - 0x05: 60 ppm
 *        - 0x06: 30 ppm
 *        - 0x07: 20 ppm
 * @retval None
 */
void hci_le_periodic_advertising_sync_transfer_received_event(uint8_t Status,
                                                              uint16_t Connection_Handle,
                                                              uint16_t Service_data,
                                                              uint16_t Sync_Handle,
                                                              uint8_t Advertising_SID,
                                                              uint8_t Advertiser_Address_Type,
                                                              uint8_t Advertiser_Address[6],
                                                              uint8_t Advertiser_PHY,
                                                              uint16_t Periodic_Advertising_Interval,
                                                              uint8_t Advertiser_Clock_Accuracy);
/**
 * @brief The HCI_LE_CIS_Established event indicates that a CIS has been
 *        established, was considered lost before being established, or (on the
 *        Central) was rejected by the Peripheral. It is generated by the
 *        Controller in the Central and Peripheral. The Connection_Handle
 *        parameter shall be set to the value provided in the HCI_LE_Create_CIS
 *        command on the Central and in the HCI_LE_CIS_Request event on the
 *        Peripheral. The CIG_Sync_Delay parameter is the maximum time, in
 *        microseconds, for transmission of PDUs of all CISes in a CIG event
 *        (see [Vol 6] Part B, Section 4.5.14.1). The CIS_Sync_Delay parameter
 *        is the maximum time, in microseconds, for transmission of PDUs of the
 *        specified CIS in a CIG event (see [Vol 6] Part B, Section 4.5.14.1).
 *        The Transport_Latency_C_To_P and Transport_Latency_P_To_C parameters
 *        are the actual transport latencies, in microseconds, as described in
 *        [Vol 6] Part G, Section 3.2.1 and [Vol 6] Part G, Section 3.2.2. The
 *        PHY_C_To_P parameter indicates the PHY selected for packets from the
 *        Central to Peripheral. The PHY_P_To_C parameter indicates the PHY
 *        selected for packets from the Peripheral to Central. The NSE,
 *        BN_C_To_P, BN_P_To_C, FT_C_To_P, FT_P_To_C, Max_PDU_- C_To_P,
 *        Max_PDU_P_To_C, and ISO_Interval parameters are the corresponding
 *        parameters of the CIS (see [Vol 6] Part B, Section 4.5.13.1). If this
 *        event is generated on the Peripheral with a non-zero status, the
 *        Controller shall delete the Connection_Handle and any associated ISO
 *        data paths.
 * @param Status For standard error codes see Bluetooth specification, Vol. 2,
 *        part D. For proprietary error code refer to Error codes section.
 * @param Connection_Handle Connection handle of the CIS.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param CIG_Sync_Delay The maximum time, in microseconds, for transmission of
 *        PDUs of all CISes in a CIG event.
 *        Values:
 *        - 0x0000EA ... 0x7FFFFF
 * @param CIS_Sync_Delay The maximum time, in microseconds, for transmission of
 *        PDUs of the specified CIS in a CIG event.
 *        Values:
 *        - 0x0000EA ... 0x7FFFFF
 * @param Transport_Latency_C_To_P The actual transport latency, in
 *        microseconds, from Central to Peripheral.
 *        Values:
 *        - 0x0000EA ... 0x7FFFFF
 * @param Transport_Latency_P_To_C The actual transport latency, in
 *        microseconds, from Peripheral to Central.
 *        Values:
 *        - 0x0000EA ... 0x7FFFFF
 * @param PHY_C_To_P The transmitter PHY of packets from the Central.
 *        Values:
 *        - 0x01: LE_1M_PHY
 *        - 0x02: LE_2M_PHY
 *        - 0x03: LE_CODED_PHY
 * @param PHY_P_To_C The transmitter PHY of packets from the Peripheral.
 *        Values:
 *        - 0x01: LE_1M_PHY
 *        - 0x02: LE_2M_PHY
 *        - 0x03: LE_CODED_PHY
 * @param NSE Maximum number of subevents in each isochronous event.
 *        Values:
 *        - 0x01 ... 0x1F
 * @param BN_C_To_P The burst number for Central to Peripheral transmission.
 *        Values:
 *        - 0x00: No data
 *        - 0x01 ... 0x0F
 * @param BN_P_To_C The burst number for Peripheral to Central transmission.
 *        Values:
 *        - 0x00: No data
 *        - 0x01 ... 0x0F
 * @param FT_C_To_P The flush timeout, in multiples of the ISO_Interval for the
