sheulisback/ble-demo-wb05kn1-nucleo-u545/firmware/Middlewares/ST/STM32WB05N/includes/stm32wb05n_events.h
                                                           uint8_t Subevent_Interval,
                                                           uint8_t Response_Slot_Delay,
                                                           uint8_t Response_Slot_Spacing);
/**
 * @brief The HCI_LE_Periodic_Advertising_Report event indicates that the
 *        Controller has received a periodic advertisement or has failed to
 *        receive an AUX_SYNC_SUBEVENT_IND PDU. The Sync_Handle parameter
 *        identifies the periodic advertising train that the report relates to.
 *        The RSSI parameter contains the RSSI value, excluding any Constant
 *        Tone Extension. If the Controller supports the Connectionless CTE
 *        Receiver feature, RSSI shall not be set to 0x7F. When multiple
 *        advertising packets are used to complete a periodic advertising report
 *        (e.g., a packet containing an AUX_SYNC_IND PDU combined with one
 *        containing an AUX_CHAIN PDU), the RSSI event parameter shall be set
 *        based on the last packet received and the TX_Power event parameter
 *        shall be set based on the AUX_SYNC_IND PDU. However, the second or
 *        subsequent events for the same periodic advertisement may instead have
 *        a TX_Power value of 0x7F. The Controller may split the data from a
 *        single periodic advertisement (whether one PDU or several) into
 *        several reports. If so, each report except the last shall have a
 *        Data_Status of "incomplete, more data to come", while the last shall
 *        have the value "complete". No further reports shall be sent for a
 *        given periodic advertisement after one with a Data_Status other than
 *        "incomplete, more data to come". A Data_Status of "incomplete, data
 *        truncated" indicates that the Controller attempted to receive an
 *        AUX_CHAIN_IND PDU but was not successful or received it but was unable
 *        to store the data. The CTE_Type parameter indicates the type of
 *        Constant Tone Extension in the periodic advertising packets. The
 *        Periodic_Event_Counter parameter indicates the periodic advertising
 *        event counter (paEventCounter) of the event that the periodic
 *        advertising packet was received in. The Subevent parameter indicates
 *        the Periodic Advertising with Responses subevent that the periodic
 *        advertising packet was received in. If the Periodic Advertising does
 *        not have subevents, then Subevent shall be set to 0xFF. If the
 *        Controller receives an AUX_CHAIN_IND PDU with no AdvData, it should
 *        send the report (or the last report if it has split the data)
 *        immediately without waiting for any subsequent AUX_CHAIN_IND PDUs.
 * @param Sync_Handle Sync handle that identifies the synchronization
 *        information about the periodic advertising train.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param TX_Power TX Power. Units: dBm
 *        Values:
 *        - -127 ... 126
 *        - 127: NA
 * @param RSSI RSSI value Units: dBm
 *        Values:
 *        - -127 ... 20: RSSI value
 *        - 127: RSSI is not available
 * @param CTE_Type
 *        Values:
 *        - 0x00: AoA Constant Tone Extension
 *        - 0x01: AoD Constant Tone Extension with 1 microsecond slots
 *        - 0x02: AoD Constant Tone Extension with 2 microseconds slots
 *        - 0xFF: No Constant Tone Extension
 * @param Periodic_Event_Counter The value of paEventCounter (see [Vol 6] Part
 *        B, Section 4.4.2.1) for the reported periodic advertising packet.
 * @param Subevent The subevent number.
 *        Values:
 *        - 0x00 ... 0x7F
 *        - 0xFF: No subevents
 * @param Data_Status Data Status
 *        Values:
 *        - 0x00: Data complete
 *        - 0x01: Data incomplete, more data to come
 *        - 0x02: Data incomplete, data truncated, no more to come
 *        - 0xFF: Failed to receive an AUX_SYNC_SUBEVENT_IND PDU
 * @param Data_Length Length of the Data field
 *        Values:
 *        - 0 ... 247: Length of the Data field
 *        - 248 ... 255: Reserved for future use
 * @param Data Data received from a Periodic Advertising packet
 * @retval None
 */
void hci_le_periodic_advertising_report_v2_event(uint16_t Sync_Handle,
                                                 int8_t TX_Power,
                                                 int8_t RSSI,
                                                 uint8_t CTE_Type,
                                                 uint16_t Periodic_Event_Counter,
                                                 uint8_t Subevent,
                                                 uint8_t Data_Status,
                                                 uint8_t Data_Length,
                                                 uint8_t Data[]);
/**
 * @brief The HCI_LE_Periodic_Advertising_Sync_Transfer_Received event is used
 *        by the Controller to report that it has received periodic advertising
 *        synchronization information from the device referred to by the
 *        Connection_Handle parameter and either successfully synchronized to
 *        the periodic advertising train or timed out while attempting to
 *        synchronize. The Status will be zero if it successfully synchronized
 *        and non-zero otherwise. The Service_Data value is provided by the Host
 *        of the device sending the information. The Sync_Handle identifies the
 *        periodic advertising in subsequent commands and events and shall be
 *        assigned by the Controller. The remaining parameters provide
 *        information about the periodic advertising (see Section 7.7.65.14). If
 *        there are no subevents or response slots, then the Controller shall
 *        set the Num_Subevents parameter to zero and the Host shall ignore the
 *        Subevent_Interval, Response_Slot_Delay, and Response_Slot_- Spacing
 *        parameters. If Status is non-zero, all parameter values are valid
 *        except Sync_Handle, which the Host shall ignore. Note: If the
 *        Controller is already synchronized to the periodic advertising train
 *        described in the received information, no event will be generated.
 * @param Status For standard error codes see Bluetooth specification, Vol. 2,
 *        part D. For proprietary error code refer to Error codes section.
 * @param Connection_Handle Connection handle that identifies the connection.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param Service_data A value provided by the peer device
 * @param Sync_Handle Sync handle that identifies the synchronization
 *        information about the periodic advertising train.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param Advertising_SID
 *        Values:
 *        - 0x00 ... 0x0F: Value of the Advertising SID used to advertise the periodic advertising
 * @param Advertiser_Address_Type
 *        Values:
 *        - 0x00: Public Device Address
 *        - 0x01: Random Device Address
 *        - 0x02: Public Identity Address (corresponds to Resolved Private Address)
 *        - 0x03: Random (static) Identity Address (corresponds to Resolved Private Address)
 * @param Advertiser_Address Public Device Address, Random Device Address,
 *        Public Identity Address, or Random (static) Identity Address of the
 *        advertiser
 * @param Advertiser_PHY
 *        Values:
 *        - 0x01: Advertiser PHY is LE 1M
 *        - 0x02: Advertiser PHY is LE 2M
 *        - 0x03: Advertiser PHY is LE Coded
 * @param Periodic_Advertising_Interval Periodic advertising interval. Time = N
 *        * 1.25 ms; Time Range: 7.5ms to 81.91875 s.
 *        Values:
 *        - 0x0006 (7.50 ms)  ... 0xFFFF (NaN) 
 * @param Advertiser_Clock_Accuracy Advertiser Clock Accuracy
 *        Values:
 *        - 0x00: 500 ppm
 *        - 0x01: 250 ppm
 *        - 0x02: 150 ppm
 *        - 0x03: 100 ppm
 *        - 0x04: 75 ppm
 *        - 0x05: 60 ppm
 *        - 0x06: 30 ppm
 *        - 0x07: 20 ppm
 * @param Num_Subevents Number of subevents.
 *        Values:
 *        - 0x00 ... 0x80
 * @param Subevent_Interval Subevent interval. Time = N x 1.25 ms.
 *        Values:
 *        - 0x00 (NaN) : No subevents
 *        - 0x06 (7.50 ms)  ... 0xFF (318.75 ms) 
 * @param Response_Slot_Delay Response slot delay. Range: 0x01 to 0xFE. Time = N
 *        x 1.25 ms
 *        Values:
 *        - 0x00 (NaN) : No response slots
 *        - 0x01 (1.25 ms)  ... 0xFE (317.50 ms) 
 * @param Response_Slot_Spacing Response slot spacing Range: 0x02 to 0xFF Time =
 *        N x 0.125 ms
 *        Values:
 *        - 0x00 (0.000 ms) : No response slots
 *        - 0x02 (0.250 ms)  ... 0xFF (31.875 ms) 
 * @retval None
 */
void hci_le_periodic_advertising_sync_transfer_received_v2_event(uint8_t Status,
                                                                 uint16_t Connection_Handle,
                                                                 uint16_t Service_data,
                                                                 uint16_t Sync_Handle,
                                                                 uint8_t Advertising_SID,
                                                                 uint8_t Advertiser_Address_Type,
                                                                 uint8_t Advertiser_Address[6],
                                                                 uint8_t Advertiser_PHY,
                                                                 uint16_t Periodic_Advertising_Interval,
                                                                 uint8_t Advertiser_Clock_Accuracy,
                                                                 uint8_t Num_Subevents,
                                                                 uint8_t Subevent_Interval,
                                                                 uint8_t Response_Slot_Delay,
                                                                 uint8_t Response_Slot_Spacing);
/**
 * @brief The HCI_LE_Periodic_Advertising_Subevent_Data_Request event is used to
 *        allow the Controller to indicate that it is ready to transmit one or
 *        more subevents and is requesting the advertising data for these
 *        subevents. The Subevent_Data_Count parameter shall be less than or
 *        equal to the number of subevents. The Subevent_Start parameter is the
 *        first subevent being requested and the Subevent_Data_Count parameter
 *        determines the subsequent subevents being requested. The subevent
 *        numbers wrap from one less than the number of subevents to zero. This
 *        event should be sent from the Controller when it has no data for
 *        upcoming subevents. The Controller should request data for as many
 *        subevents as it has memory to accept to minimize the number of events
 *        generated by the Controller.
 * @param Advertising_Handle Used to identify a periodic advertising train.
 * @param Subevent_Start The first subevent that data is requested for.
 *        Values:
 *        - 0x00 ... 0x7F
 * @param Subevent_Data_Count The number of subevents that data is requested
 *        for.
 *        Values:
 *        - 0x01 ... 0x80
 * @retval None
 */
void hci_le_periodic_advertising_subevent_data_request_event(uint8_t Advertising_Handle,
                                                             uint8_t Subevent_Start,
                                                             uint8_t Subevent_Data_Count);
/**
 * @brief The HCI_LE_Periodic_Advertising_Response_Report event indicates that
 *        one or more Bluetooth devices have responded to a periodic advertising
 *        subevent during a PAwR train. The Controller may queue these
 *        advertising reports and send information from multiple devices in one
 *        HCI_LE_Periodic_Advertising_- Response_Report event. The Controller
 *        may fail to transmit the synchronization packet required to enable the
 *        response packets to be sent. If this happens, the Controller can
 *        report this to the Host using the Tx_Status parameter. The Controller
 *        may split the data from a single response into several reports. If so,
 *        each report except the last shall have a Data_Status of "incomplete,
 *        more data to come", while the last shall have the value "complete". No
 *        further reports shall be sent for a given periodic advertisement after
 *        one with a Data_Status other than "incomplete, more data to come".
 * @param Advertising_Handle Used to identify a periodic advertising train.
 * @param Subevent The subevent number.
 * @param Tx_Status If AUX_SYNC_SUBEVENT_IND was transmitted or not.
 * @param Num_Responses Number of responses in event.
 *        Values:
 *        - 0x00 ... 0x19
 * @param Periodic_Advertising_Response See @ref Periodic_Advertising_Response_t
 * @retval None
 */
void hci_le_periodic_advertising_response_report_event(uint8_t Advertising_Handle,
                                                       uint8_t Subevent,
                                                       uint8_t Tx_Status,
                                                       uint8_t Num_Responses,
                                                       Periodic_Advertising_Response_t Periodic_Advertising_Response[]);
/**
 * @brief The HCI_LE_Enhanced_Connection_Complete event indicates to both of the
 *        Hosts forming the connection that a new connection has been created.
 *        Upon the creation of the connection a Connection_Handle shall be
 *        assigned by the Controller, and passed to the Host in this event. If
 *        the connection creation fails, this event shall be provided to the
 *        Host that had issued the HCI_LE_Create_- Connection or
 *        HCI_LE_Extended_Create_Connection command. If this event is unmasked
 *        and the HCI_LE_Connection_Complete event is unmasked, only the
 *        HCI_LE_Enhanced_Connection_Complete event is sent when a new
 *        connection has been created. This event indicates to the Host that
 *        issued an HCI_LE_Create_Connection or
 *        HCI_LE_Extended_Create_Connection command and received an
 *        HCI_Command_Status event if the connection creation failed or was
 *        successful. The Peer_Address, Peer_Resolvable_Private_Address, and
 *        Local_- Resolvable_Private_Address shall always reflect the most
 *        recent packet sent and received on air. The Central_Clock_Accuracy
 *        parameter is only valid for a Peripheral. On a Central, this parameter
 *        shall be set to 0x00. If the connection is established from periodic
 *        advertising with responses and Role is 0x00, then the
 *        Advertising_Handle parameter shall be set according to the periodic
 *        advertising train the connection was established from. If the
 *        connection is established from periodic advertising with responses and
 *        Role is 0x01, then the Sync_Handle parameter shall be set according to
 *        the periodic advertising train the connection was established from. In
 *        all other circumstances, Advertising_Handle and Sync_Handle shall be
 *        set to No Advertising_Handle and No Sync_Handle and shall be ignored
 *        by the Host.
 * @param Status For standard error codes see Bluetooth specification, Vol. 2,
 *        part D. For proprietary error code refer to Error codes section.
 * @param Connection_Handle Connection handle to be used to identify the
 *        connection with the peer device.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param Role Role of the local device in the connection.
 *        Values:
 *        - 0x00: Central
 *        - 0x01: Peripheral
 * @param Peer_Address_Type 0x00 Public Device Address 0x01 Random Device
 *        Address 0x02 Public Identity Address (Corresponds to Resolved Private
 *        Address) 0x03 Random (Static) Identity Address (Corresponds to
 *        Resolved Private Address)
 *        Values:
 *        - 0x00: Public Device Address
 *        - 0x01: Random Device Address
 *        - 0x02: Public Identity Address
 *        - 0x03: Random (Static) Identity Address
 * @param Peer_Address Public Device Address, Random Device Address, Public
 *        Identity Address or Random (static) Identity Address of the device to
 *        be connected.
 * @param Local_Resolvable_Private_Address Resolvable Private Address being used
 *        by the local device for this connection. This is only valid when the
 *        Own_Address_Type is set to 0x02 or 0x03. For other Own_Address_Type
 *        values, the Controller shall return all zeros.
 * @param Peer_Resolvable_Private_Address Resolvable Private Address being used
 *        by the peer device for this connection. This is only valid for
 *        Peer_Address_Type 0x02 and 0x03. For other Peer_Address_Type values,
 *        the Controller shall return all zeros.
 * @param Connection_Interval Connection interval used on this connection. Time
 *        = N * 1.25 msec
 *        Values:
 *        - 0x0006 (7.50 ms)  ... 0x0C80 (4000.00 ms) 
 * @param Peripheral_Latency Maximum Peripheral latency for the connection in
 *        number of connection events.
 *        Values:
 *        - 0x0000 ... 0x01F3
 * @param Supervision_Timeout Supervision timeout for the LE Link. It shall be a
 *        multiple of 10 ms and larger than (1 + connPeripheralLatency) *
 *        connInterval * 2. Time = N * 10 msec.
 *        Values:
 *        - 0x000A (100 ms)  ... 0x0C80 (32000 ms) 
 * @param Central_Clock_Accuracy Central clock accuracy. Only valid for a
 *        Peripheral.
 *        Values:
 *        - 0x00: 500 ppm
 *        - 0x01: 250 ppm
 *        - 0x02: 150 ppm
 *        - 0x03: 100 ppm
 *        - 0x04: 75 ppm
 *        - 0x05: 50 ppm
 *        - 0x06: 30 ppm
 *        - 0x07: 20 ppm
 * @param Advertising_Handle Used to identify an advertising set.
 * @param Sync_Handle Sync_Handle identifying the periodic advertising train.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 *        - 0xFFFF: No Sync_Handle
 * @retval None
 */
void hci_le_enhanced_connection_complete_v2_event(uint8_t Status,
                                                  uint16_t Connection_Handle,
                                                  uint8_t Role,
                                                  uint8_t Peer_Address_Type,
                                                  uint8_t Peer_Address[6],
                                                  uint8_t Local_Resolvable_Private_Address[6],
                                                  uint8_t Peer_Resolvable_Private_Address[6],
                                                  uint16_t Connection_Interval,
                                                  uint16_t Peripheral_Latency,
                                                  uint16_t Supervision_Timeout,
                                                  uint8_t Central_Clock_Accuracy,
                                                  uint8_t Advertising_Handle,
                                                  uint16_t Sync_Handle);
/**
 * @}
 */
/**
 * @}
 */

