sheulisback/ble-demo-wb05kn1-nucleo-u545/firmware/Middlewares/ST/STM32WB05N/includes/stm32wb05n_events.h
/**
 *@addtogroup GAP GAP
 *@brief Generic Access Profile.
 *@{
 */
/**
 *@defgroup ACI_GAP_events ACI GAP events
 *@brief Events for GAP layer.
 *@{
 */
/* ACI GAP events */
/**
 * @brief This event is generated by the controller when the limited
 *        discoverable mode ends due to timeout. The timeout is 180 seconds.
 * @retval None
 */
void aci_gap_limited_discoverable_event(void);
/**
 * @brief This event is generated when the pairing process has completed
 *        successfully or a pairing procedure timeout has occurred or the
 *        pairing has failed. This is to notify the application that we have
 *        paired with a remote device so that it can take further actions or to
 *        notify that a timeout has occurred so that the upper layer can decide
 *        to disconnect the link.
 * @param Connection_Handle Connection handle on which the pairing procedure
 *        completed
 * @param Status Pairing status. If 0x02, see Reason code.
 *        Values:
 *        - 0x00: Success
 *        - 0x01: Timeout
 *        - 0x02: Pairing Failed
 *        - 0x03: Encryption failed, LTK missing on local device
 *        - 0x04: Encryption failed, LTK missing on peer device
 *        - 0x05: Encryption not supported by remote device
 * @param Reason Pairing reason error code
 *        Values:
 *        - 0x00
 *        - 0x01: SM_PASSKEY_ENTRY_FAILED
 *        - 0x02: SM_OOB_NOT_AVAILABLE
 *        - 0x03: SM_AUTHENTICATION_REQUIREMENTS
 *        - 0x04: SM_CONFIRM_VALUE_FAILED
 *        - 0x05: SM_PAIRING_NOT_SUPPORTED
 *        - 0x06: SM_ENCRYPTION_KEY_SIZE
 *        - 0x07: SM_CMD_NOT_SUPPORTED
 *        - 0x08: SM_UNSPECIFIED_REASON
 *        - 0x09: SM_REPEATED_ATTEMPTS
 *        - 0x0A: SM_INVALID_PARAMETERS
 *        - 0x0B: SMP_DHKEY_CHECK_FAILED
 *        - 0x0C: SMP_NUMCOMPARISON_FAILED
 *        - 0x0D: SM_BR_EDR_PAIRING_IN_PROGRESS
 *        - 0x0E: SM_CROSS_TRANSPORT_KEY_NOT_ALLOWED
 *        - 0x0F: SM_KEY_REJECTED
 * @retval None
 */
void aci_gap_pairing_complete_event(uint16_t Connection_Handle,
                                    uint8_t Status,
                                    uint8_t Reason);
/**
 * @brief This event is generated by the Security manager to the application
 *        when a passkey is required for pairing. When this event is received,
 *        the application has to respond with the @ref aci_gap_passkey_resp
 *        command.
 * @param Connection_Handle Connection handle for which the passkey has been
 *        requested.
 * @param Display_Input This parameter informs the application if the passkey
 *        needs to be displayed or requested for input on the local device.
 *        Values:
 *        - 0x00: PASSKEY_DISPLAY
 *        - 0x01: PASSKEY_INPUT
 * @retval None
 */
void aci_gap_passkey_req_event(uint16_t Connection_Handle,
                               uint8_t Display_Input);
/**
 * @brief This event is sent by the GAP to the upper layers when a procedure
 *        previously started has been terminated by the upper layer or has
 *        completed for any other reason
 * @param Procedure_Code Code identifying the procedure.
 *        Values:
 *        - 0x00: GAP_LIMITED_DISCOVERY_PROC
 *        - 0x01: GAP_GENERAL_DISCOVERY_PROC
 *        - 0x02: GAP_AUTO_CONNECTION_ESTABLISHMENT_PROC
 *        - 0x03: GAP_GENERAL_CONNECTION_ESTABLISHMENT_PROC
 *        - 0x04: GAP_SELECTIVE_CONNECTION_ESTABLISHMENT_PROC
 *        - 0x05: GAP_OBSERVATION_PROC
 *        - 0x06: GAP_DIRECT_CONNECTION_ESTABLISHMENT_PROC
 *        - 0x07: GAP_NAME_DISCOVERY_PROC
 * @param Status For standard error codes see Bluetooth specification, Vol. 2,
 *        part D. For proprietary error code refer to Error codes section.
 * @param Data_Length Length of Data in octets
 * @param Data Procedure Specific Data: - For Name Discovery Procedure: the name
 *        of the peer device if the procedure completed successfully.
 * @retval None
 */
void aci_gap_proc_complete_event(uint8_t Procedure_Code,
                                 uint8_t Status,
                                 uint8_t Data_Length,
                                 uint8_t Data[]);
/**
 * @brief This event is sent only by a privacy enabled Peripheral. The event is
 *        sent to the upper layers when the peripheral is unsuccessful in
 *        resolving the resolvable address of the peer device after connecting
 *        to it.
 * @param Connection_Handle Connection handle for which the private address
 *        could not be resolved with any of the stored IRK's.
 * @retval None
 */
void aci_gap_addr_not_resolved_event(uint16_t Connection_Handle);
/**
 * @brief This event is sent only during SC v.4.2 Pairing, when Numeric
 *        Comparison Association model is selected, in order to show the Numeric
 *        Value generated, and to ask for Confirmation to the User. When this
 *        event is received, the application has to respond with the  @ref
 *        aci_gap_numeric_comparison_value_confirm_yesno command
 * @param Connection_Handle Connection handle related to the underlying Pairing
 * @param Numeric_Value
 * @retval None
 */
void aci_gap_numeric_comparison_value_event(uint16_t Connection_Handle,
                                            uint32_t Numeric_Value);
/**
 * @brief This event is sent only during SC v.4.2 Pairing, when Keypress
 *        Notifications are supported, in order to show the input type signalled
 *        by the peer device, having Keyboard only I/O capabilities. When this
 *        event is received, no action is required to the User.
 * @param Connection_Handle Connection handle related to the underlying Pairing
 * @param Notification_Type Type of Keypress input notified/signaled by peer
 *        device
 *        Values:
 *        - 0x00: PASSKEY_ENTRY_STARTED
 *        - 0x01: PASSKEY_DIGIT_ENTERED
 *        - 0x02: PASSKEY_DIGIT_ERASED
 *        - 0x03: PASSKEY_CLEARED
 *        - 0x04: PASSKEY_ENTRY_COMPLETED
 * @retval None
 */
void aci_gap_keypress_notification_event(uint16_t Connection_Handle,
                                         uint8_t Notification_Type);
/**
 * @brief This event may be generated when there is a request to start a pairing
 *        process.  Application shall respond with aci_gap_pairing_resp command
 *        to accept or reject the incoming pairing procedure notified through
 *        this event.   If the pairing is going to start with a non-bonded
 *        device, the Bonded parameter is set to 0. Instead, if the pairing
 *        process is going to start with an already bonded device, the event is
 *        raised with Bonded parameter set to 1. This may happen either if the
 *        peer has lost the bond or if it is a malicious device.   If
 *        aci_gap_set_security_requirements command was given with
 *        Pairing_Response set to 1 (pairing confirmation only for bonded
 *        devices), the event is raised only if pairing is going to be initiated
 *        with a bonded device.
 * @param Connection_Handle
 * @param Bonded Indicates if the peer device is already bonded or not.
 *        Values:
 *        - 0x00: DEVICE_NOT_BONDED
 *        - 0x01: DEVICE_BONDED
 * @retval None
 */
void aci_gap_pairing_event(uint16_t Connection_Handle,
                           uint8_t Bonded);
/**
 * @}
 */
/**
 * @}
 */

/**
 *@addtogroup GATT GATT
 *@brief Generic Attribute Profile.
 *@{
 */
/**
 *@defgroup ACI_GATT_ATT_events ACI GATT/ATT events
 *@brief Events for GATT layer.
 *@{
 */
/* ACI GATT/ATT events */
/** Documentation for C struct Attribute_Group_Handle_Pair_t */
typedef struct Attribute_Group_Handle_Pair_t_s {
  /** Found Attribute handle
   */
  uint16_t Found_Attribute_Handle;
  /** Group End handle
   */
  uint16_t Group_End_Handle;
} Attribute_Group_Handle_Pair_t;

