sheulisback/ble-demo-wb05kn1-nucleo-u545/firmware/Middlewares/ST/STM32WB05N/includes/stm32wb05n_events.h
/**
 *@addtogroup L2CAP L2CAP
 *@brief Logical Link Control and Adaptation Protocol.
 *@{
 */
/**
 *@defgroup ACI_L2CAP_events ACI L2CAP events
 *@brief Events for L2CAP layer.
 *@{
 */
/* ACI L2CAP events */
/**
 * @brief This event is generated when the central responds to the connection
 *        update request packet with a connection update response packet.
 * @param Connection_Handle Connection handle referring to the COS Channel where
 *        the Disconnection has been received.
 * @param Result
 * @retval None
 */
void aci_l2cap_connection_update_resp_event(uint16_t Connection_Handle,
                                            uint16_t Result);
/**
 * @brief This event is generated when the central does not respond to the
 *        connection update request packet with a connection update response
 *        packet or a command reject packet within 30 seconds.
 * @param Connection_Handle Handle of the connection related to this L2CAP
 *        procedure.
 * @param Data_Length Length of following data
 * @param Data
 * @retval None
 */
void aci_l2cap_proc_timeout_event(uint16_t Connection_Handle,
                                  uint8_t Data_Length,
                                  uint8_t Data[]);
/**
 * @brief The event is given by the L2CAP layer when a connection update request
 *        is received from the peripheral. The upper layer which receives this
 *        event has to respond by sending a @ref
 *        aci_l2cap_connection_parameter_update_resp command.
 * @param Connection_Handle Handle of the connection related to this L2CAP
 *        procedure.
 * @param Identifier This is the identifier which associates the request to the
 *        response.
 * @param L2CAP_Length Length of the L2CAP connection update request.
 * @param Connection_Interval_Min Minimum value for the connection event
 *        interval. This shall be less than or equal to Connection_Interval_Max.
 *        Time = N * 1.25 msec.
 *        Values:
 *        - 0x0006 (7.50 ms)  ... 0x0C80 (4000.00 ms) 
 * @param Connection_Interval_Max Maximum value for the connection event
 *        interval. This shall be greater than or equal to
 *        Connection_Interval_Min. Time = N * 1.25 msec.
 *        Values:
 *        - 0x0006 (7.50 ms)  ... 0x0C80 (4000.00 ms) 
 * @param Max_Latency Maximum Peripheral latency for the connection in number of
 *        connection events.
 *        Values:
 *        - 0x0000 ... 0x01F3
 * @param Timeout_Multiplier Defines connection timeout parameter in the
 *        following manner: Timeout Multiplier * 10ms.
 *        Values:
 *        - 10 (100 ms)  ... 3200 (32000 ms) 
 * @retval None
 */
void aci_l2cap_connection_update_req_event(uint16_t Connection_Handle,
                                           uint8_t Identifier,
                                           uint16_t L2CAP_Length,
                                           uint16_t Connection_Interval_Min,
                                           uint16_t Connection_Interval_Max,
                                           uint16_t Max_Latency,
                                           uint16_t Timeout_Multiplier);
/**
 * @brief Event raised when an L2CAP channel using LE Credit Based Flow Control
 *        mode is terminated.
 * @param Connection_Handle Handle identifying the connection.
 * @param CID The local channel endpoint that identifies the L2CAP channel.
 * @retval None
 */
void aci_l2cap_cos_disconnection_complete_event(uint16_t Connection_Handle,
                                                uint16_t CID);
/**
 * @brief Event raised when an L2CAP_FLOW_CONTROL_CREDIT_IND is received from
 *        the peer, which means that it is capable of receiving additional
 *        K-frames (for example after it has processed one or more K-frames) in
 *        LE Credit Based Flow Control.
 * @param Connection_Handle Handle identifying the connection.
 * @param CID The local channel endpoint that identifies the L2CAP channel.
 * @param TX_Credits The number of additional k-frames that the peer's L2CAP
 *        layer entity can receive.
 * @param TX_Credit_Balance Remaining number of K-frames that local L2CAP layer
 *        entity can currently send to the peer.
 *        Values:
 *        - 1 ... 65535
 * @retval None
 */
void aci_l2cap_cos_flow_control_credit_event(uint16_t Connection_Handle,
                                             uint16_t CID,
                                             uint16_t TX_Credits,
                                             uint16_t TX_Credit_Balance);
/**
 * @brief Event raised when an SDU to be transmitted has been processed by the
 *        local L2CAP layer entity.
 * @param Connection_Handle Handle identifying the connection.
 * @param CID The local channel endpoint that identifies the L2CAP channel.
 * @param SDU_Length
 * @param TX_Credit_Balance Remaining number of K-frames that local L2CAP layer
 *        entity can currently send to the peer.
 * @retval None
 */
void aci_l2cap_cos_sdu_data_tx_event(uint16_t Connection_Handle,
                                     uint16_t CID,
                                     uint16_t SDU_Length,
                                     uint16_t TX_Credit_Balance);
/**
 * @brief Event raised when an SDU has been received.
 * @param Connection_Handle Handle identifying the connection.
 * @param CID The local channel endpoint that identifies the L2CAP channel.
 * @param RX_Credit_Balance Remaining number of K-frames that local L2CAP layer
 *        entity can currently receive from the peer. If automatic management of
 *        credits is enabled, this number is automatically changed after the SDU
 *        is extracted.
 * @param SDU_Length
 * @param SDU_Data
 * @retval None
 */
void aci_l2cap_cos_sdu_data_rx_nwk_event(uint16_t Connection_Handle,
                                         uint16_t CID,
                                         uint16_t RX_Credit_Balance,
                                         uint16_t SDU_Length,
                                         uint8_t SDU_Data[]);
/**
 * @brief Event generated when receiving an L2CAP_CREDIT_BASED_RECONFIGURE_REQ
 *        or an L2CAP_CREDIT_BASED_RECONFIGURE_RSP, to reconfigure one or more
 *        (up to 5) L2CAP Enhanced Credit Based Flow Control channels.
 * @param Connection_Handle Connection handle that identifies the connection.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param Event_Type
 *        Values:
 *        - 0x00: L2CAP_ECFC_RECONFIGURE_REQ
 *        - 0x01: L2CAP_ECFC_RECONFIGURE_RESP
 * @param Result Result of the connection request if Event_Type is
 *        L2CAP_ECFC_CONN_RESP. To be ignored if Event_Type is
 *        L2CAP_ECFC_CONN_REQ.
 *        Values:
 *        - 0x0000: L2CAP_RECONFIG_SUCCESSFUL
 *        - 0x0001: L2CAP_RECONFIG_FAIL_MTU_REDUCTION_NOT_ALLOWED
 *        - 0x0002: L2CAP_RECONFIG_FAIL_MPS_REDUCTION_NOT_ALLOWED
 *        - 0x0003: L2CAP_RECONFIG_FAIL_INVALID_CID
 *        - 0x0004: L2CAP_RECONFIG_FAIL_UNACCEPTABLE_PARAMETERS
 * @param Identifier This is the identifier which associates the request to the
 *        response.
 * @param Peer_MTU The maximum SDU size (in octets) that the remote L2CAP layer
 *        entity can receive on this channel after successful reconfiguration.
 *        Values:
 *        - 64 ... 65535
 * @param Peer_MPS The maximum PDU payload size (in octets) that the remote
 *        L2CAP layer entity can receive on this channel after successful
 *        reconfiguration.
 *        Values:
 *        - 64 ... 65535
 * @param CID_Count Number of Channels that are going to be created.
 *        Values:
 *        - 0x01 ... 0x05
 * @param Local_CID Array of up to 5 two-octet values that represent the local
 *        channel endpoints identifying the EATT channels to be reconfigured.
 * @retval None
 */
void aci_l2cap_cos_reconfiguration_event(uint16_t Connection_Handle,
                                         uint8_t Event_Type,
                                         uint16_t Result,
                                         uint8_t Identifier,
                                         uint16_t Peer_MTU,
                                         uint16_t Peer_MPS,
                                         uint8_t CID_Count,
                                         uint16_t Local_CID[]);
/**
 * @brief This event is generated when the central rejects a L2CAP request.
 * @param Connection_Handle Handle identifying the connection.
 * @param Identifier This is the identifier which associates the request to the
 *        response.
 * @param Reason Reason
 * @param Data_Length Length of following data
 * @param Data Data field associated with Reason
 * @retval None
 */
void aci_l2cap_command_reject_event(uint16_t Connection_Handle,
                                    uint8_t Identifier,
                                    uint16_t Reason,
                                    uint8_t Data_Length,
                                    uint8_t Data[]);
/**
 * @brief Event generated when a request is received from the peer to create one
 *        L2CAP Credit Based Flow Control channel or one or more (up to 5) L2CAP
 *        Enhanced Credit Based Flow Control channels.
 * @param Connection_Handle Connection handle that identifies the connection.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param Channel_Type Type of channel: LE Credit Based Flow Control Mode or
 *        Enhanced Credit Based Flow Control Mode.
 *        Values:
 *        - 0x00: L2CAP_CHANNEL_TYPE_LE_CFC
 *        - 0x01: L2CAP_CHANNEL_TYPE_ECFC
 * @param Identifier This is the identifier which associates the request to the
 *        response.
 * @param SPSM Simplified Protocol/Service Multiplexer
 *        Values:
 *        - 0x0001 ... 0x00FF
 * @param Peer_MTU The maximum SDU size (in octets) that the remote L2CAP layer
 *        entity can receive on this channel.
 *        Values:
 *        - 64 ... 65535
 * @param Peer_MPS The maximum PDU payload size (in octets) that the remote
 *        L2CAP layer entity can receive on this channel.
 *        Values:
 *        - 64 ... 65535
 * @param Initial_Credits The number of K-frames that can be sent to the L2CAP
 *        layer entity of the peer device as soon as the L2CAP channel is
 *        established.
 * @param CID_Count
 * @retval None
 */
void aci_l2cap_cos_connection_req_event(uint16_t Connection_Handle,
                                        uint8_t Channel_Type,
                                        uint8_t Identifier,
                                        uint16_t SPSM,
                                        uint16_t Peer_MTU,
                                        uint16_t Peer_MPS,
                                        uint16_t Initial_Credits,
                                        uint8_t CID_Count);
/**
 * @brief Event generated when a response is received from the peer to create
 *        one L2CAP Credit Based Flow Control channel or one or more (up to 5)
 *        L2CAP Enhanced Credit Based Flow Control channels.
 * @param Connection_Handle Connection handle that identifies the connection.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param Channel_Type Type of channel: LE Credit Based Flow Control Mode or
 *        Enhanced Credit Based Flow Control Mode.
 *        Values:
 *        - 0x00: L2CAP_CHANNEL_TYPE_LE_CFC
 *        - 0x01: L2CAP_CHANNEL_TYPE_ECFC
 * @param Peer_MTU The maximum SDU size (in octets) that the remote L2CAP layer
 *        entity can receive on this channel.
 *        Values:
 *        - 64 ... 65535
 * @param Peer_MPS The maximum PDU payload size (in octets) that the remote
 *        L2CAP layer entity can receive on this channel.
 *        Values:
 *        - 64 ... 65535
 * @param Initial_Credits The number of K-frames that can be sent to the L2CAP
 *        layer entity of the peer device as soon as the L2CAP channel is
 *        established.
 * @param Result Outcome of the connetion request.
 *        Values:
 *        - 0x0000: L2CAP_CONN_SUCCESSFUL
 *        - 0x0002: L2CAP_CONN_FAIL_SPSM_NOT_SUPPORTED
 *        - 0x0004: L2CAP_CONN_FAIL_INSUFFICIENT_RESOURCES
 *        - 0x0005: L2CAP_CONN_FAIL_INSUFFICIENT_AUTHENTICATION
 *        - 0x0006: L2CAP_CONN_FAIL_INSUFFICIENT_AUTHORIZATION
 *        - 0x0007: L2CAP_CONN_FAIL_KEY_SIZE_TOO_SHORT
 *        - 0x0008: L2CAP_CONN_FAIL_INSUFFICIENT_ENCRYPTION
 *        - 0x0009: L2CAP_CONN_FAIL_INVALID_SOURCE_CID
 *        - 0x000A: L2CAP_CONN_FAIL_SOURCE_CID_ALREADY_ALLOCATED
 *        - 0x000B: L2CAP_CONN_FAIL_UNACCEPTABLE_PARAMETERS
 *        - 0x000C: L2CAP_CONN_FAIL_INVALID_PARAMETERS
 *        - 0x000D: L2CAP_CONN_FAIL_NO_INFO
 *        - 0x000E: L2CAP_CONN_FAIL_AUTHENTICATION_PENDING
 *        - 0x000F: L2CAP_CONN_FAIL_AUTHORIZATION_PENDING
 * @param CID_Count Number of channels to be created which are present in the
 *        L2CAP Credit Based Connection Request. The effective number of
 *        channels that will be opened can be less than this value (see
 *        Local_CID) .
 *        Values:
 *        - 0x01 ... 0x05
 * @param CID Array of up to 5 two-octet values that represent the local channel
 *        endpoints.
 * @retval None
 */
void aci_l2cap_cos_connection_resp_event(uint16_t Connection_Handle,
                                         uint8_t Channel_Type,
                                         uint16_t Peer_MTU,
                                         uint16_t Peer_MPS,
                                         uint16_t Initial_Credits,
                                         uint16_t Result,
                                         uint8_t CID_Count,
                                         uint16_t CID[]);
/**
 * @}
 */
/**
 * @}
 */

/**
 *@addtogroup HAL_LL HAL/LL
 *@brief HAL and proprietary LL API layer.
 *@{
 */
/**
 *@defgroup ACI_HAL_events ACI HAL events
 *@brief Events for HAL and proprietary LL.
 *@{
 */
/* ACI HAL events */
/**
 * @brief This event inform the application that the network coprocessor has
 *        been reset. If the reason code is a system crash, a following event
 *        @ref aci_blue_crash_info_event will provide more information regarding
 *        the system crash details.
 * @param Reason_Code Reason code describing why device was reset and in which
 *        mode is operating (Updater or Normal mode)
 *        Values:
 *        - 0x01: Firmware started properly
 *        - 0x02: Updater mode entered with ACI command
 *        - 0x03: Updater mode entered due to bad Blue Flag
 *        - 0x04: Updater mode entered due to boot pin
 *        - 0x05: System reset due to watchdog
 *        - 0x06: System reset due to lockup
 *        - 0x07: System reset due to brownout reset
 *        - 0x08: System reset due to crash
 *        - 0x09: System reset due to ECC error
 * @retval None
 */
void aci_blue_initialized_event(uint8_t Reason_Code);
/**
 * @brief This event is given to the application after the @ref
 *        aci_blue_initialized_event when a system crash is detected. This
 *        events returns system crash information for debugging purposes.
 *        Information reported are useful to understand the root cause of the
 *        crash.
 * @param Crash_Type Crash type
 *        Values:
 *        - 0x00: Assert failed
 *        - 0x01: NMI fault
 *        - 0x02: Hard fault
 * @param SP Stack pointer
 * @param R0 Register R0
 * @param R1 Register R1
 * @param R2 Register R2
 * @param R3 Register R3
 * @param R12 Register R12
 * @param LR Link register
 * @param PC Program counter where crash occurred
 * @param xPSR xPSR register
 * @param Debug_Data_Length Length of Debug_Data field
 * @param Debug_Data Debug data
 * @retval None
 */
void aci_blue_crash_info_event(uint8_t Crash_Type,
                               uint32_t SP,
                               uint32_t R0,
                               uint32_t R1,
                               uint32_t R2,
                               uint32_t R3,
                               uint32_t R12,
                               uint32_t LR,
                               uint32_t PC,
                               uint32_t xPSR,
                               uint8_t Debug_Data_Length,
                               uint8_t Debug_Data[]);
/**
 * @brief This event is generated when the device completes a radio activity and
 *        provide information when a new radio activity will be performed.
 *        Information provided includes type of radio activity and absolute time
 *        in system ticks when a new radio activity is schedule, if any.
 *        Application can use this information to schedule user activities
 *        synchronous to selected radio activities. A command @ref
 *        aci_hal_set_radio_activity_mask is provided to enable radio activity
 *        events of user interests, by default no events are enabled. User
 *        should take into account that enabling radio events in application
 *        with intense radio activity could lead to a fairly high rate of events
 *        generated. Application use cases includes synchronizing notification
 *        with connection interval, switching  antenna at the end of advertising
 *        or performing flash erase operation while radio is idle.
 * @param Last_State Completed radio events
 *        Values:
 *        - 0x00: Idle
 *        - 0x01: Advertising
 *        - 0x02: Connection event peripheral
 *        - 0x03: Scanning
 *        - 0x04: Connection request
 *        - 0x05: Connection event central
 *        - 0x06: TX test mode
 *        - 0x07: RX test mode
 * @param Next_State Incoming radio events
 *        Values:
 *        - 0x00: Idle
 *        - 0x01: Advertising
 *        - 0x02: Connection event peripheral
 *        - 0x03: Scanning
 *        - 0x04: Connection request
 *        - 0x05: Connection event central
 *        - 0x06: TX test mode
 *        - 0x07: RX test mode
 * @param Next_State_SysTime 32bit absolute current time expressed in internal
 *        time units.
 * @retval None
 */
void aci_hal_end_of_radio_activity_event(uint8_t Last_State,
                                         uint8_t Next_State,
                                         uint32_t Next_State_SysTime);
/**
 * @brief This event is generated to report firmware error information.
 * @param FW_Error_Type Code identifying the type of error that has occurred in
 *        Bluetooth stack.  0x01: L2CAP layer failed recombining a PDU; 0x02:
 *        GATT layer received an unexpteced response (protocol violation); 0x03:
 *        GATT layer received an unexpteced request (protocol violation); 0x04:
 *        No space to store info GATT database info in NVM (database clean-up
 *        needed or bonding entries to be removed); 0x05: No space to store
 *        bonding info in NVM  (database clean-up  needed or bonding entries to
 *        be removed); 0x06: Link Layer scheduler failed to reschedule slots for
 *        too many times (a system reset is recommended; 0x07: Out of memory
 *        resources for isochronous channels; 0x08: Error in programming timer
 *        for CTE reception functionality.
 *        Values:
 *        - 0x01: HAL_FW_L2CAP_RECOMBINATION_ERROR
 *        - 0x02: HAL_FW_GATT_UNEXPECTED_RESPONSE_ERROR
 *        - 0x03: HAL_FW_GATT_SEQUENTIAL_PROTOCOL_ERROR
 *        - 0x04: HAL_FW_BONDING_DB_FULL_GATTSERVICE_ERROR
 *        - 0x05: HAL_FW_BONDING_DB_FULL_PAIRING_ERROR
 *        - 0x06: HAL_FW_SCHEDULER_OVERRUN_ERROR
 *        - 0x07: HAL_FW_MEMBUF_NOT_AVAILABLE
 *        - 0x08: HAL_FW_CTE_TIMER_PROGRAM_ERROR
 * @param Data_Length Length of Data in octets
 * @param Data The error event info. If FW_Error_Type is 0x01, 0x02 or 0x03,
 *        this parameter contains the connection handle where the abnormal
 *        condition has occurred.
 * @retval None
 */
void aci_hal_fw_error_event(uint8_t FW_Error_Type,
                            uint8_t Data_Length,
                            uint8_t Data[]);
/**
 * @brief This event is generated when the amount of transmitted test packets
 *        specified with aci_hal_transmitter_test_packets() has been reached.
 * @param Number_Of_Packets The number of test packets actually transmitted.
 * @retval None
 */
void aci_hal_le_test_end_event(uint16_t Number_Of_Packets);
/**
 * @}
 */
/**
 * @}
 */
#endif /* _STM32WB05N_EVENTS_H_ */
